mistyrain83/cc3200app/user/wifiapp/main.c
//*****************************************************************************
//
// Application Name     - cc3200app
// Application Overview - this is cc3200 main app
// 
// author  - Qixb
// date    - 2014-09-23
//
//*****************************************************************************

// Standard includes
#include <stdlib.h>
#include <string.h>
#include <stdio.h>

// Simplelink includes
#include "simplelink.h"
#include "netcfg.h"

// Driverlib includes
#include "hw_ints.h"
#include "hw_types.h"
#include "hw_memmap.h"
#include "hw_common_reg.h"
#include "interrupt.h"
#include "utils.h"
#include "rom.h"
#include "rom_map.h"
#include "prcm.h"
#include "pin.h"
#include "gpio.h"
#include "timer.h"

// OS includes
#include "osi.h"

// Common interface includes
#include "gpio_if.h"
#ifndef NOTERM
#include "uart_if.h"
#endif
#include "timer_if.h"
#include "common.h"

// App Includes
//#include "device_status.h"
#include "smartconfig.h"
#include "pin_mux_config.h"
#include "communication.h"
#include "do.h"
#include "pwmout.h"

#include "main.h"

#define APPLICATION_VERSION              "0.1.1"
#define APP_NAME_RELAY					"Wifi App Board RELAY"
#define APP_NAME_PUCK_SWITCH                   "Wifi App Board PUCK SWITCH"
#define OOB_TASK_PRIORITY                1
#define SPAWN_TASK_PRIORITY              9
#define OOB_STACK_SIZE                   2048
#define SH_GPIO_3                       3       /* P58 GPIO_03 - Device Mode - Button Pin */
#define AUTO_CONNECTION_TIMEOUT_COUNT   50      /* 5 Sec */
#define SL_STOP_TIMEOUT                 200

#define LED_TASK_PRIORITY              2
#define LED_STACK_SIZE                 1024

#define BUF_SIZE            14
#define BUF_RECV_SIZE            1024

#define MYIP_LEN_MAX  16
#define MYPORT_LEN_MAX  5

#define TCP_LISTEN_PORT 5001

#define MSG_SEND_LOOP_NUM 20 // 2s =  20*100ms

#define SWITCH_BOUNCE_TIME 40000  // ~50ms for UtilsDelay function parameter


typedef enum
{
  LED_OFF = 0,
  LED_ON,
  LED_BLINK
}eLEDStatus;

// Application specific status/error codes
typedef enum{
    // Choosing -0x7D0 to avoid overlap w/ host-driver's error codes
    TCP_CLIENT_FAILED = -0x7D0,
    TCP_SERVER_FAILED = TCP_CLIENT_FAILED - 1,
    DEVICE_NOT_IN_STATION_MODE = TCP_SERVER_FAILED - 1,

    STATUS_CODE_MAX = -0xBB8
}e_AppStatusCodes;

//*****************************************************************************
//                 GLOBAL VARIABLES -- Start
//*****************************************************************************
static const char pcDigits[] = "0123456789";
static unsigned char POST_token[] = "__SL_P_ULD";
static unsigned char GET_token_TEMP[]  = "__SL_G_UTP";
static unsigned char GET_token_ACC[]  = "__SL_G_UAC";
static unsigned char GET_token_UIC[]  = "__SL_G_UIC";
static int g_iInternetAccess = -1;

static unsigned int g_uiDeviceModeConfig = ROLE_STA; // default is STA mode
static unsigned long  g_ulStatus = 0; // SimpleLink Status
static unsigned char  g_ucConnectionSSID[SSID_LEN_MAX+1]; //Connection SSID
static unsigned char  g_ucConnectionBSSID[BSSID_LEN_MAX]; //Connection BSSID

static int g_iTcpSocketID = -1;

unsigned char g_cBsdBuf[BUF_SIZE];
unsigned char g_ucBsdRecvBuf[BUF_RECV_SIZE];

unsigned char g_cServerIP[MYIP_LEN_MAX];
unsigned char g_cServerPort[MYPORT_LEN_MAX];

char g_cCurrentIP[MYIP_LEN_MAX];
unsigned int g_iIP[4];
unsigned int g_uiServerIP = 0;
unsigned short g_usServerPort = 0;

unsigned int g_iSaveFlag = FAILURE;
unsigned int g_iIPLen = 0;
unsigned int g_iPortLen = 0;
unsigned int g_iCurrentIPLen = 0;

S_DO_CMD g_sRedLed;
S_DO_CMD g_sDO[DO_CHN_NUM];
unsigned int g_iSendLoopNum = 0;

unsigned int g_iSwPressedNum = 0; // Button pressed number


#if defined(ccs)
extern void (* const g_pfnVectors[])(void);
#endif
#if defined(ewarm)
extern uVectorEntry __vector_table;
#endif


//*****************************************************************************
//                 GLOBAL VARIABLES -- End
//*****************************************************************************


#ifdef USE_FREERTOS
//*****************************************************************************
//
//! Application defined hook (or callback) function - the tick hook.
//! The tick interrupt can optionally call this
//!
//! \param  none
//!
//! \return none
//!
//*****************************************************************************
void
vApplicationTickHook( void )
{
}

//*****************************************************************************
//
//! Application defined hook (or callback) function - assert
//!
//! \param  none
//!
//! \return none
//!
//*****************************************************************************
void
vAssertCalled( const char *pcFile, unsigned long ulLine )
{
    while(1)
    {

    }
}

//*****************************************************************************
//
//! Application defined idle task hook
//!
//! \param  none
//!
//! \return none
//!
//*****************************************************************************
void
vApplicationIdleHook( void )
{

}

//*****************************************************************************
//
//! Application provided stack overflow hook function.
//!
//! \param  handle of the offending task
//! \param  name  of the offending task
//!
//! \return none
//!
//*****************************************************************************
void
vApplicationStackOverflowHook( OsiTaskHandle *pxTask, signed char *pcTaskName)
{
    ( void ) pxTask;
    ( void ) pcTaskName;

    for( ;; );
}

void vApplicationMallocFailedHook()
{
    while(1)
  {
    // Infinite loop;
  }
}
#endif


//*****************************************************************************
// SimpleLink Asynchronous Event Handlers -- Start
//*****************************************************************************


//*****************************************************************************
//
//! \brief The Function Handles WLAN Events
//!
//! \param[in]  pWlanEvent - Pointer to WLAN Event Info
//!
//! \return None
//!
//*****************************************************************************
void SimpleLinkWlanEventHandler(SlWlanEvent_t *pWlanEvent)
{
    if(pWlanEvent == NULL)
    {
        UART_PRINT("Null pointer\n\r");
        LOOP_FOREVER();
    }
    switch(pWlanEvent->Event)
    {
        case SL_WLAN_CONNECT_EVENT:
        {
            SET_STATUS_BIT(g_ulStatus, STATUS_BIT_CONNECTION);

            //
            // Information about the connected AP (like name, MAC etc) will be
            // available in 'slWlanConnectAsyncResponse_t'
            // Applications can use it if required
            //
            //  slWlanConnectAsyncResponse_t *pEventData = NULL;
            // pEventData = &pWlanEvent->EventData.STAandP2PModeWlanConnected;
            //

            // Copy new connection SSID and BSSID to global parameters
            memcpy(g_ucConnectionSSID,pWlanEvent->EventData.
                   STAandP2PModeWlanConnected.ssid_name,
                   pWlanEvent->EventData.STAandP2PModeWlanConnected.ssid_len);
            memcpy(g_ucConnectionBSSID,
                   pWlanEvent->EventData.STAandP2PModeWlanConnected.bssid,
                   SL_BSSID_LENGTH);

