mistyrain83/cc3200app/user/wifiapp/main.c
				  LOOP_FOREVER();
		        }
			}

			g_iSendLoopNum++;
			osi_Sleep(100);
		}
    }	

}

//****************************************************************************
//
//! Period Cycles Timer; Process the main async event
//!
//! \param  none
//!
//! \return none
//
//****************************************************************************
void TimerA1IntHandler(void)
{
	int i = 0;
	//
    // Clear the timer interrupt.
    //
    Timer_IF_InterruptClear(TIMERA1_BASE);

	// Process event
	for(i = 0; i < DO_CHN_NUM; i++)
	{
		switch(g_sDO[i].cmd)
		{
			case DO_CMD_OFF:
				GPIO_IF_DOOff(i);
				g_sDO[i].cmd = DO_CMD_DEFAULT;
				break;
			case DO_CMD_ON:
				GPIO_IF_DOOn(i);
				g_sDO[i].cmd = DO_CMD_DEFAULT;
				break;
			case DO_CMD_TOGGLE:
				GPIO_IF_DOToggle(i);
				g_sDO[i].cmd = DO_CMD_DEFAULT;
				break;
			default:
				break;
			
		}
		
		if(g_sDO[i].flag == TRUE)
		{
			g_sDO[i].loopnum--;
			
			if(g_sDO[i].loopnum == 0)
			{
				g_sDO[i].flag = FALSE;
				GPIO_IF_DOToggle(i);
				g_sDO[i].cmd = DO_CMD_DEFAULT;
			}
		}
	}
    
}

//*****************************************************************************
//
//! This function is button (switch) interrupt handler, also process the
//! switch bounce. the delay timer is SWITCH_BOUNCE_TIME
//!
//! \param  none
//!
//! \return none
//!
//*****************************************************************************
void ButtonIntHandler(void)
{
	static long L_prevButtonState = 0x00;    
	static long L_buttonState     = 0x00;

	if(MAP_GPIOIntStatus(BUTTON_PORT, true) & BUTTON_PINS)
	{
		MAP_GPIOIntClear(BUTTON_PORT, BUTTON_PINS);
	}
	
	L_buttonState = GPIOPinRead(BUTTON_PORT, BUTTON_PINS);
	
	if( !(L_prevButtonState & BUTTON_PINS) && (L_buttonState & BUTTON_PINS) )
	{
		g_iSwPressedNum++;
		if(g_iSwPressedNum == 1)
		{
			//
		    // Turn on the button interrupt timers
		    //
		    Timer_IF_Start(TIMERA0_BASE, TIMER_A,
		                  PERIODIC_TEST_CYCLES * PERIODIC_TEST_LOOPS);
		}
		UART_PRINT("[INFO] BUTTON pressed\n\r");
	}
	
	L_prevButtonState = L_buttonState;
	MAP_UtilsDelay(SWITCH_BOUNCE_TIME);
}

//*****************************************************************************
//
//! This function handles the times of button pressed
//!
//! \param  none
//!
//! \return none
//!
//*****************************************************************************
void TimerA0IntHandler(void)
{
	//
    // Clear the timer interrupt.
    //
    Timer_IF_InterruptClear(TIMERA0_BASE);
	Timer_IF_Stop(TIMERA0_BASE, TIMER_A);
	switch(g_iSwPressedNum)
	{
	case 4:
		UART_PRINT("Button pressed 4 times\n");
		break;
	case 6:
		UART_PRINT("Button pressed 6 times\n");
		break;
	default:
		UART_PRINT("Button pressed %d times\n", g_iSwPressedNum);
		break;
	}
	g_iSwPressedNum = 0;
	UART_PRINT("Clear button pressed number\n");
}

//*****************************************************************************
//
//! Application startup display on UART
//!
//! \param  none
//!
//! \return none
//!
//*****************************************************************************
static void
DisplayBanner(char * AppName)
{
    UART_PRINT("\n\n\n\r");
    UART_PRINT("\t\t *************************************************\n\r");
    UART_PRINT("\t\t     CC3200 %s Application       \n\r", AppName);
	UART_PRINT("\t  Application Version  %s\n\r", APPLICATION_VERSION);
    UART_PRINT("\t\t *************************************************\n\r");
    UART_PRINT("\n\n\n\r");
}

//*****************************************************************************
//
//! Board Initialization & Configuration
//!
//! \param  None
//!
//! \return None
//
//*****************************************************************************
static void
BoardInit(void)
{
/* In case of TI-RTOS vector table is initialize by OS itself */
#ifndef USE_TIRTOS
    //
    // Set vector table base
    //
#if defined(ccs)
    MAP_IntVTableBaseSet((unsigned long)&g_pfnVectors[0]);
#endif  //ccs
#if defined(ewarm)
    MAP_IntVTableBaseSet((unsigned long)&__vector_table);
#endif  //ewarm
    
#endif  //USE_TIRTOS
    
    //
    // Enable Processor
    //
    MAP_IntMasterEnable();
    MAP_IntEnable(FAULT_SYSTICK);

    PRCMCC3200MCUInit();
}

//****************************************************************************
//                            MAIN FUNCTION
//****************************************************************************
void main()
{
    long   lRetVal = -1;

    //
    // Board Initilization
    //
    BoardInit();
    
    //
    // Configure the pinmux settings for the peripherals exercised
    //
    PinMuxConfig();

	////////////////////////////////////////////////////////////////
	// Configure button timer and interrupt handler
	// BUTTON - PIN_58 - GPIO_03
	////////////////////////////////////////////////////////////////
	//
    // Configuring the timers
    //
    Timer_IF_Init(PRCM_TIMERA0, TIMERA0_BASE, TIMER_CFG_PERIODIC_UP, TIMER_A, 0);
	//
    // Setup the interrupts for the timer timeouts.
    //
    Timer_IF_IntSetup(TIMERA0_BASE, TIMER_A, TimerA0IntHandler);

    // Init button interrupt handler
    GPIO_IF_ConfigureNIntEnable(BUTTON_PORT, BUTTON_PINS, GPIO_FALLING_EDGE, ButtonIntHandler);

	////////////////////////////////////////////////////////////////
	// Init Periodic timer interrupt handler, 100ms
	////////////////////////////////////////////////////////////////
	//
    // Configuring the timers
    //
    Timer_IF_Init(PRCM_TIMERA1, TIMERA1_BASE, TIMER_CFG_PERIODIC, TIMER_A, 0);
	//
    // Setup the interrupts for the timer timeouts.
    //
    Timer_IF_IntSetup(TIMERA1_BASE, TIMER_A, TimerA1IntHandler);
	//
    // Turn on the timers
    //
	Timer_IF_Start(TIMERA1_BASE, TIMER_A,
                  PERIODIC_TEST_CYCLES * PERIODIC_TEST_LOOPS / 50);

    // Initialize Global Variables
    InitializeAppVariables();
    
    //
    // UART Init
    //
    #ifndef NOTERM
    InitTerm();
	#endif

	//
    // Display Banner
    //
	#if defined(P_RELAY_BOARD)
	DisplayBanner(APP_NAME_RELAY);
	#elif defined(P_PUCK_SWITCH_BOARD)
	DisplayBanner(APP_NAME_PUCK_SWITCH);
	#endif
    
	//
	// DO Init
	//
	GPIO_IF_DOConfigure(DO1|DO2|DO3|DO4);
    GPIO_IF_DOOff(MCU_ALL_DO_IND);

	//
    // BUTTON Init
    //
	
    //
    // LED Init
    //
    GPIO_IF_LedConfigure(LED_RED|LED_GREEN);
	//
    // Turn On and Then Turn Off the RED and GREEN LEDs
    //
    GPIO_IF_LedOn(MCU_ALL_LED_IND);
	// Delay ~0.3 sec
	MAP_UtilsDelay(8000000);
    GPIO_IF_LedOff(MCU_ALL_LED_IND);
	
    //
    // Simplelinkspawntask
    //
    lRetVal = VStartSimpleLinkSpawnTask(SPAWN_TASK_PRIORITY);
    if(lRetVal < 0)
    {
        ERR_PRINT(lRetVal);
		GPIO_IF_LedOn(MCU_LOOP_FOREVER_GPIO);
        LOOP_FOREVER();
    } 

    //
    // Create OOB Task
    //
    lRetVal = osi_TaskCreate(OOBTask, (signed char*)"OOBTask", \
                                OOB_STACK_SIZE, NULL, \
                                OOB_TASK_PRIORITY, NULL );
    if(lRetVal < 0)
    {
        ERR_PRINT(lRetVal);
		GPIO_IF_LedOn(MCU_LOOP_FOREVER_GPIO);
        LOOP_FOREVER();
    }
	
    //
    // Start OS Scheduler
    //
    osi_start();

    while (1)
    {
		// GPIO_IF_LedToggle(MCU_RED_LED_GPIO);
    }

}
